const User = require('../init_db').User;
exports.confCity = async function(reqBody){
    const {token,city} = reqBody;
    if ((!token)||(!city)){
        return {
            code: '001',
            info: '参数缺失'
        }
    }
    let haveCity = (function(city){
        let cityList = ["北京市","上海市","天津市","重庆市","海口市","三亚市","儋州市","三沙市","银川市","石嘴山市","吴忠市","中卫市","固原市","拉萨市","日喀则市","林芝市","山南市","昌都市","阿里地区","那曲地区","西宁市","海西蒙古族藏族自治州","海东市","海南藏族自治州","海北藏族自治州","玉树藏族自治州","黄南藏族自治州","果洛藏族自治州","厦门市","福州市","泉州市","漳州市","莆田市","宁德市","南平市","龙岩市","三明市","长春市","吉林市","延边朝鲜族自治州","四平市","通化市","松原市","白山市","辽源市","白城市","贵阳市","遵义市","黔东南苗族侗族自治州","黔南布依族苗族自治州","安顺市","黔西南布依族苗族自治州","毕节市","六盘水市","铜仁市","西安市","咸阳市","渭南市","宝鸡市","榆林市","汉中市","延安市","安康市","商洛市","铜川市","太原市","晋中市","大同市","运城市","临汾市","长治市","忻州市","吕梁市","晋城市","阳泉市","朔州市","杭州市","宁波市","温州市","嘉兴市","金华市","绍兴市","台州市","湖州市","舟山市","丽水市","衢州市","南昌市","赣州市","九江市","上饶市","宜春市","抚州市","吉安市","景德镇市","鹰潭市","新余市","萍乡市","石家庄市","保定市","唐山市","廊坊市","邯郸市","秦皇岛市","沧州市","邢台市","张家口市","承德市","衡水市","呼和浩特市","包头市","鄂尔多斯市","呼伦贝尔市","赤峰市","通辽市","乌兰察布市","锡林郭勒盟","巴彦淖尔市","兴安盟","乌海市","阿拉善盟","哈尔滨市","大庆市","齐齐哈尔市","牡丹江市","佳木斯市","绥化市","鸡西市","双鸭山市","伊春市","黑河市","鹤岗市","大兴安岭地区","七台河市","武汉市","宜昌市","襄阳市","荆州市","孝感市","黄冈市","黄石市","咸宁市","恩施土家族苗族自治州","十堰市","荆门市","鄂州市","随州市","南京市","苏州市","无锡市","常州市","南通市","徐州市","镇江市","扬州市","盐城市","泰州市","淮安市","连云港市","宿迁市","南宁市","桂林市","柳州市","玉林市","北海市","梧州市","百色市","钦州市","贵港市","河池市","贺州市","防城港市","来宾市","崇左市","长沙市","株洲市","衡阳市","岳阳市","湘潭市","常德市","郴州市","邵阳市","怀化市","娄底市","永州市","益阳市","湘西土家族苗族自治州","张家界市","沈阳市","大连市","鞍山市","丹东市","抚顺市","营口市","盘锦市","锦州市","葫芦岛市","辽阳市","本溪市","阜新市","铁岭市","朝阳市","兰州市","酒泉市","天水市","张掖市","嘉峪关市","白银市","定西市","庆阳市","平凉市","武威市","金昌市","陇南市","临夏回族自治州","甘南藏族自治州","乌鲁木齐市","克拉玛依市","巴音郭楞蒙古自治州","伊犁哈萨克自治州","昌吉回族自治州","哈密市","阿克苏地区","喀什地区","阿勒泰地区","塔城地区","吐鲁番市","博尔塔拉蒙古自治州","和田地区","克孜勒苏柯尔克孜自治州","昆明市","丽江市","大理白族自治州","红河哈尼族彝族自治州","曲靖市","西双版纳傣族自治州","玉溪市","楚雄彝族自治州","德宏傣族景颇族自治州","文山壮族苗族自治州","保山市","普洱市","临沧市","迪庆藏族自治州","昭通市","怒江傈僳族自治州","合肥市","芜湖市","蚌埠市","马鞍山市","滁州市","安庆市","六安市","阜阳市","宣城市","黄山市","淮南市","宿州市","铜陵市","淮北市","亳州市","池州市","青岛市","济南市","烟台市","潍坊市","威海市","临沂市","济宁市","淄博市","泰安市","东营市","德州市","日照市","聊城市","菏泽市","滨州市","枣庄市","莱芜市","郑州市","洛阳市","南阳市","新乡市","信阳市","开封市","商丘市","许昌市","安阳市","平顶山市","驻马店市","焦作市","周口市","漯河市","濮阳市","三门峡市","鹤壁市","成都市","绵阳市","南充市","乐山市","德阳市","宜宾市","泸州市","眉山市","内江市","遂宁市","雅安市","资阳市","凉山彝族自治州","达州市","广安市","自贡市","广元市","攀枝花市","阿坝藏族羌族自治州","巴中市","甘孜藏族自治州","广州市","深圳市","东莞市","佛山市","珠海市","惠州市","中山市","江门市","汕头市","湛江市","肇庆市","揭阳市","清远市","潮州市","梅州市","茂名市","韶关市","阳江市","河源市","汕尾市","云浮市"]
        if(cityList.indexOf(city)==-1){
            return false;
        }
        return true;
    })(city)
    if(!haveCity){
        return {
            code: '003',
            info: '无效city'
        }
    }
    try{
        var user = await User.findOne({ token }).exec();
        if(user){
            if(user.city === city){
                return {
                    code: '000',
                    info: '订阅成功'
                }
            }
            user.city = city;
            user.save();
            return {
                code: '000',
                info: '订阅成功',
                data: user.city
            }
        } else {
            return {
                code: '002',
                info: '无效证书'
            }
        }
    }catch(err){
        return {
            code: '004',
            info: '数据库错误'
        }
    } 
}